straga/micropython_upy/ports/esp32/boards/STRAGA_dev_kit1_8mb/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "DEVKIT v1 8mb"
#define MICROPY_HW_MCU_NAME "ESP32"
